[
    {
        "kind": "books#volume",
        "id": "Ar3eAAAAMAAJ",
        "etag": "jGhIrDJN1/w",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/Ar3eAAAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử quân sự Việt Nam",
            "authors": [
                "Viện lịch sử quân sự Việt Nam"
            ],
            "publishedDate": "2001",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015055968245"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 442,
            "printType": "BOOK",
            "categories": [
                "Military art and science"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.4.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=Ar3eAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=Ar3eAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=Ar3eAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=1&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=Ar3eAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_qu%C3%A2n_s%E1%BB%B1_Vi%E1%BB%87t_Nam.html?hl=&id=Ar3eAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=Ar3eAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "EV1uAAAAMAAJ",
        "etag": "j3xkP5Xh7Zs",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/EV1uAAAAMAAJ",
        "volumeInfo": {
            "title": "Almanach những sự kiện lịch sử Việt Nam",
            "authors": [
                "Đình Nhân Phạm"
            ],
            "publishedDate": "1999",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015042910839"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 1248,
            "printType": "BOOK",
            "categories": [
                "Almanacs, Vietnamese"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.5.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=EV1uAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=EV1uAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=EV1uAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=2&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=EV1uAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/Almanach_nh%E1%BB%AFng_s%E1%BB%B1_ki%E1%BB%87n_l%E1%BB%8Bch_s%E1%BB%AD.html?hl=&id=EV1uAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=EV1uAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "yuPGEAAAQBAJ",
        "etag": "9TpMG8KeoCU",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/yuPGEAAAQBAJ",
        "volumeInfo": {
            "title": "Dấu Xưa - Tản Mạn Lịch Sử Nhà Nguyễn",
            "authors": [
                "Mathilde Tuyết Trần"
            ],
            "publisher": "NXB Trẻ",
            "description": "DẤU XƯA – TẢN MẠN LỊCH SỬ NHÀ NGUYỄN của nhà du khảo lịch sử Mathilde Tuyết Trần là một cuộc hành trình nho nhỏ chất chứa tình cảm về đất và người, đưa bạn đọc trở về một đoạn trong quá khứ lịch sử Việt Nam dưới thời nhà Nguyễn và thời Pháp thuộc. Sách gồm 5 chương đề cập đến một số khía cạnh có ý nghĩa nhất định, từ trách nhiệm để mất chủ quyền quốc gia dưới thời vua Tự Đức (chương I) đến cuộc khởi nghĩa vũ trang có sức chiến đấu bền bỉ nhất vào cuối thế kỷ XIX - đầu thế kỷ XX (chương IV), rồi chuyện hai nhà vua yêu nước Hàm Nghi và Duy Tân bị lưu đày xa Tổ quốc (chương II và chưong III). Sự kiện kể trong chương cuối cùng (chương V) tuy bắt đầu từ 10 năm sau khi nhà Nguyễn kết thúc, nhưng nhân vật chính trong chương lại là hậu duệ của vua Minh Mạng.",
            "readingModes": {
                "text": false,
                "image": true
            },
            "pageCount": 340,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=yuPGEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=yuPGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=yuPGEAAAQBAJ&printsec=frontcover&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=4&source=gbs_api",
            "infoLink": "https://play.google.com/store/books/details?id=yuPGEAAAQBAJ&source=gbs_api",
            "canonicalVolumeLink": "https://play.google.com/store/books/details?id=yuPGEAAAQBAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "FOR_SALE",
            "isEbook": true,
            "listPrice": {
                "amount": 37799,
                "currencyCode": "VND"
            },
            "retailPrice": {
                "amount": 37799,
                "currencyCode": "VND"
            },
            "buyLink": "https://play.google.com/store/books/details?id=yuPGEAAAQBAJ&rdid=book-yuPGEAAAQBAJ&rdot=1&source=gbs_api",
            "offers": [
                {
                    "finskyOfferType": 1,
                    "listPrice": {
                        "amountInMicros": 37799000000,
                        "currencyCode": "VND"
                    },
                    "retailPrice": {
                        "amountInMicros": 37799000000,
                        "currencyCode": "VND"
                    }
                }
            ]
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "PARTIAL",
            "embeddable": true,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": true,
                "acsTokenLink": "http://books.google.com.vn/books/download/D%E1%BA%A5u_X%C6%B0a_T%E1%BA%A3n_M%E1%BA%A1n_L%E1%BB%8Bch_S%E1%BB%AD_Nh%C3%A0-sample-pdf.acsm?id=yuPGEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"
            },
            "webReaderLink": "http://play.google.com/books/reader?id=yuPGEAAAQBAJ&hl=&source=gbs_api",
            "accessViewStatus": "SAMPLE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "DẤU XƯA – TẢN MẠN LỊCH SỬ NHÀ NGUYỄN của nhà du khảo lịch sử Mathilde Tuyết Trần là một cuộc hành trình nho nhỏ chất chứa tình cảm về đất và người, đưa bạn đọc trở về một ..."
        }
    },
    {
        "kind": "books#volume",
        "id": "3NAcAAAAMAAJ",
        "etag": "iDygFLfYvIU",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/3NAcAAAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử Thanh Hóa",
            "authors": [
                "Ban nghiên cứu và biên soạn lịch sử Thanh Hóa"
            ],
            "publishedDate": "1990",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015019326027"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 296,
            "printType": "BOOK",
            "categories": [
                "Thanh Hóa (Vietnam : Province)"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.8.2.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=3NAcAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=3NAcAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=3NAcAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=5&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=3NAcAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_Thanh_H%C3%B3a.html?hl=&id=3NAcAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=3NAcAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "VuHGEAAAQBAJ",
        "etag": "xyczViuszV8",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/VuHGEAAAQBAJ",
        "volumeInfo": {
            "title": "Nạn Đói Năm 1945 Ở Việt Nam",
            "subtitle": "Những Chứng Tích Lịch Sử",
            "authors": [
                "GS Văn Tạo",
                "GS. Furuta Motoo"
            ],
            "publisher": "NXb Chính Trị Quốc Gia",
            "description": "Bằng lời kể của những người chứng kiến nạn đói, kết hợp với tư liệu trước đó, sách \"Nạn đói 1945 ở Việt Nam - những chứng tích lịch sử\" tái hiện chân thực bức tranh nạn đói 1945. Cho tới nay, nhắc tới nạn đói 1945, có lẽ người Việt Nam nào cũng biết hơn 2 triệu người đã chết đói trong thảm họa đó. Những tư liệu viết về nạn đói không quá khó tìm, còn lưu lại rải rác trong các tài liệu đã thành văn như sách, báo. Tuy nhiên, nghiên cứu về sự kiện lịch sử này từ các nhân chứng lịch sử mang một ý nghĩa khác. Qua lời kể, trí nhớ của những người từng chứng kiến và đi qua nạn đói, sự việc được thể hiện mang tính khách quan, chân xác, đáng tin cậy. Hai phiên bản cuốn Nạn đói năm 1945 ở Việt Nam - Những chứng tích lịch sử. Tiểu ban hợp tác Việt - Nhật đã thực hiện một nghiên cứu về nạn đói, trong đó một phần nghiên cứu dựa trên tiếp xúc nhân chứng. Công trình này được xuất bản thành sách Nạn đói 1945 ở Việt Nam - Những chứng tích lịch sử do GS Văn Tạo và GS Furuta Moto chủ biên. Điều tra thực địa Nhóm nghiên cứu đã điều tra thực địa theo phương pháp xã hội học lịch sử. Gọi là điều tra thực địa, bởi các nhà nghiên cứu đã tiến hành điều tra ngay trên chính mảnh đất mà nạn đói xảy ra vào năm 1945. Nạn đói diễn ra trên diện rộng, ở 32 tỉnh, 2 thành phố miền Bắc. Kinh phí, nhân lực có hạn, nên nhóm nghiên cứu đã tìm một số nơi làm điểm, từ đó khải quát ra cả diện. Nơi được chọn làm “điểm” có thể là một thôn, một xã, một huyện… là nơi diễn ra nạn đói rõ nét, tiêu biểu cho nhiều thôn xã ở vùng được chọn. Nơi đó cũng phải còn nhiều người từng sống sót qua nạn đói 1945. Các điểm điều tra cũng phải đảm bảo phải nằm ở cả đồng bằng, trung du, miền núi, có điểm là làng quê, có điểm ven đô thị; đa số các điểm làm nông nghiệp, nhưng cũng có điểm làm nghề thủ công, ngư nghiệp, buôn bán nhỏ… GS Văn Tạo (trái) và GS Furuta Moto - hai đồng chủ biên cuốn sách. Có 3 đợt điều tra tại 23 điểm đã được thực hiện. Đợt một tiến hành ở xã Tây Lương, huyện Tiền Hải, tỉnh Thái Bình vào mùa hè năm 1992. Đợt 2 điều tra ở 7 điểm: Cổ Bi (Gia Lâm), Do Nhân Hạ (Mê Linh), Quần Mục (Đồ Sơn, Hải Phòng), Chi Lai (Kiến An, Hải Phòng), Đồng Côi (Nam Ninh, Nam Định), Tây Yên (Gia Khánh, Ninh Bình), Làng Trung (thành phố Vinh, Nghệ An). Đợt 3 tiến hành ở 15 địa điểm từ Quảng Trị trở ra, gồm: Quảng Trị, Quảng Bình, Hà Tĩnh, Thanh Hóa, Hòa Bình, Hà Nam, Hà Đông, Phú Thọ, Bắc Ninh, Bắc Giang, Hải Dương, Hưng Yên, Quảng Yên, Thái Nguyên, Cao Bằng. Tại mỗi điểm, các nhà nghiên cứu tìm gặp những người già đã sống sót qua nạn đói, hỏi chuyện, ghi âm, chụp hình lời kể của họ. Dựa trên những lời kể đó, cùng với các tư liệu trong sổ sách, nhóm nghiên cứu đã thống kê, phân tích chi tiết thông tin thu thập được. Mỗi điểm nghiên cứu đều được khái quát tình hình chung của địa phương, đời sống của nhân dân trước khi xảy ra nạn đói. Phần thống kê coi trọng không chỉ số người bị chết bởi nạn đói mà còn chú trọng tới hoàn cảnh riêng của từng hộ. Có hộ khá giả cũng chết đói, có hộ nghèo nhưng nhận sự giúp đỡ, hoặc tham gia phá kho thóc Nhật mà được cứu đói… Nhờ đó, thảm cảnh nạn đói được thể hiện chân xác, cụ thể tới từng thôn, xóm, từng hộ gia đình, từng nạn nhân chết đói. Ví dụ, tại điểm điều tra xã Tây Lượng, huyện Tiền Hải, Thái Bình, nhóm nghiên cứu biết được năm 1945 toàn xã có 4 thôn, 3 trại với 6.000 dân, số người chết đói là 2/3 xã. Ở Thôn Lương Phú, có 280 hộ, trong đó số hộ chết hết là: 54, chiếm 19,28%, số người chết đói là 594 người (chiếm 43,07% dân số). Xóm Trại của thôn Thượng là nơi chết đói nhiều nhất trong xã, đã bị xóa sổ. Số hộ ở xóm là 34 hộ, 130 khẩu, thì có tới 103 khẩu chết đói, chỉ còn lại 27 người. Tỉ lệ chết đói ở đây là 79%. Trại này đã bị xóa sổ sau nạn đói 1945. Tại xóm Bối Xuyên, có 51 hộ, thì 40 hộ có người chết đói, trong đó 18 hộ chết sạch cả gia đình. Chỉ có 10 hộ không bị chết. Hai dòng họ Tô và Lại gần như bị xóa sổ. Ngõ xóm Giữa thôn Thượng có 9 gia đình, với 61 nhân khẩu, thì bị chết đói tới 59 người, chỉ còn 2 người thoát chết (tỷ lệ 96,7%). Cái nhìn đa chiều Những thống kê chi tiết tới từng xóm, từng hộ gia đình, từng người là nạn nhân của nạn đói được thể hiện trong sách. Cuốn sách thể hiện khái quát tình hình chung ở điểm điều tra, đưa ra được số liệu thống kê cụ thể về các hộ gia đình, danh sách các chủ hộ và thành viên trong gia đình, số người chết đói, số người sống sót, ghi chú những điểm cần thiết. Điểm giá trị của công trình này là những nhân chứng cung cấp tài liệu bằng câu chuyện họ kể Không chỉ thống kê về số người bị nạn đói cướp đi sinh mạng, những thống kê chi tiết của sách còn cho thấy bức tranh đời sống một số địa phương Việt Nam những năm 1945. Ở mỗi điểm điều tra xã hội học, nhóm lập bảng thống kê chi tiết theo từng hộ gia đình. Trong đó, cho thấy số nhân khẩu trong gia đình, quan hệ trong từng gia đình, nghề nghiệp của từng người... Cuốn sách cũng đưa ra những nghiên cứu từ tư liệu thành văn trước đó, như tư liệu về cơ cấu tổ chức vơ vét thóc gạo của phát xít Nhật, tư liệu diễn biến nạn đói, bao gồm thư tịch, tranh ảnh, bản đồ. Ở phần cuối, sách đưa ra kết luận công trình nghiên cứu, nhằm nói lên sự tàn khốc của nạn đói năm 1945. Sách in kèm phụ lục là những bức ảnh mà nghệ sĩ nhiếp ảnh Võ An Ninh chụp về nạn đói. Cho tới nay, Nạn đói năm 1945 ở Việt Nam - Những chứng tích lịch sử được coi là công trình dầy dặn nhất nghiên cứu về thảm kịch này. Cuốn sách giúp hậu thế có cái nhìn toàn cảnh đa chiều, sâu sắc và chân xác về nạn đói 1945. *** Nạn đói năm 1945 làm khoảng 400 ngàn - 2 triệu người chết. Ngày nay, nhắc đến nạn đói khủng khiếp năm Ất Dậu ấy người ta sẽ chỉ nhớ có thể, hoặc nếu hơn thì sẽ là những hình ảnh bi thảm trong những thước phim của bộ phim Sao Tháng Tám. Nạn Đói Năm 1945 Ở Việt Nam (Những Chứng Tích Lịch Sử) là công trình nghiên cứu được công bố năm 1995 do Giáo sư Văn Tạo và Giáo sư Furuta Motoo chủ biên. Đến khi ấy, công chúng mới ngỡ ngàng và tìm về cái năm bi thảm nhất trong lịch sử Việt Nam hiện đại. Chết vì đói là cái chết đáng sợ nhất của bất cứ sinh vật nào. Cái chết đến từ từ, không ngừng giày xéo, đày đọa con người trong đau đớn, tủi nhục và sợ hãi. Thế nhưng nạn đói năm 1945 còn gây nên những tấn thảm kịch mà không ai có thể tưởng tượng được. Những ngôi hàng trống rỗng, những con đường ngập xác người hôi thối, những hố chôn tập thể dày đặc. Cái đói tiêu diệt mọi giá trị, phá huỷ nhân cách, đập vỡ lương tri - những thảm kịch mà cái đói biến người ta thành quỷ dữ, những em bé bị chó hoang ăn thịt, cha con giết nhau vì một miếng ăn. Tàn khốc, kinh hoàng là tất cả những gì có thể dùng để nhắc về thảm kịch năm ấy. Con số 2 triệu người cứ như thế xoáy sâu dần dần vào lịch sử và sẽ nhắc cho độc giả thấy, 1945 không chỉ là một năm của độc lập huy hoàng, đó còn là năm của tang thương mất mát. Nạn đói năm 1945 ở Việt Nam được xem là nạn đói thảm khốc nhất trong lịch sử nhân loại, cướp đi tính mạng của hơn hai triệu người vô tội và để lại biết bao hậu quả tang thương cho nhiều thế hệ. Nhưng chìm lấp giữa vô số biến động của thời đại, tiếng kêu phẫn uất thấu tận trời xanh của nạn nhân năm Ất Dậu đôi lúc tưởng chừng rơi vào quên lãng. Mãi tới năm 1995, sự ra đời của công trình nghiên cứu vĩ đại Nạn đói năm 1945 ở Việt Nam - Những chứng tích lịch sử do Giáo sư Văn Tạo và Giáo sư Furuta Motoo chủ biên mới giúp hậu thế có được cái nhìn toàn cảnh đa chiều sâu sắc và chân xác về sự kiện đau xót này. Dựa trên khối tư liệu đồ sộ được xử lý nghiêm túc hiếm có, công trình vừa dựng lại thảm trạng chết đói của người Việt, vừa phân tích cặn kẽ tội ác của phát xít Nhật. Với sự hợp tác của đội ngũ tri thức từ cả hai nước, đây là công trình công phu độc nhất có cái nhìn khách quan thấu suốt vào sự thật lịch sử nạn đói năm 1945 ở Việt Nam. Hơn mười lăm năm kể từ ngày công bố, Nạn đói năm 1945 ở Việt Nam - Những chứng tích lịch sử vẫn còn nguyên giá trị. Mời các bạn đón đọc Nạn Đói Năm 1945 Ở Việt Nam - Những Chứng Tích Lịch Sử của tác giả Văn Tạo & Furuta Motoo.",
            "readingModes": {
                "text": false,
                "image": true
            },
            "pageCount": 792,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=VuHGEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=VuHGEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=VuHGEAAAQBAJ&printsec=frontcover&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=6&source=gbs_api",
            "infoLink": "https://play.google.com/store/books/details?id=VuHGEAAAQBAJ&source=gbs_api",
            "canonicalVolumeLink": "https://play.google.com/store/books/details?id=VuHGEAAAQBAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "FOR_SALE",
            "isEbook": true,
            "listPrice": {
                "amount": 51449,
                "currencyCode": "VND"
            },
            "retailPrice": {
                "amount": 51449,
                "currencyCode": "VND"
            },
            "buyLink": "https://play.google.com/store/books/details?id=VuHGEAAAQBAJ&rdid=book-VuHGEAAAQBAJ&rdot=1&source=gbs_api",
            "offers": [
                {
                    "finskyOfferType": 1,
                    "listPrice": {
                        "amountInMicros": 51449000000,
                        "currencyCode": "VND"
                    },
                    "retailPrice": {
                        "amountInMicros": 51449000000,
                        "currencyCode": "VND"
                    }
                }
            ]
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "PARTIAL",
            "embeddable": true,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": true,
                "acsTokenLink": "http://books.google.com.vn/books/download/N%E1%BA%A1n_%C4%90%C3%B3i_N%C4%83m_1945_%E1%BB%9E_Vi%E1%BB%87t_Nam-sample-pdf.acsm?id=VuHGEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"
            },
            "webReaderLink": "http://play.google.com/books/reader?id=VuHGEAAAQBAJ&hl=&source=gbs_api",
            "accessViewStatus": "SAMPLE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "Nạn Đói Năm 1945 Ở Việt Nam (Những Chứng Tích Lịch Sử) là công trình nghiên cứu được công bố năm 1995 do Giáo sư Văn Tạo và Giáo sư Furuta Motoo chủ biên. Đến khi ấy, công chúng mới ngỡ ..."
        }
    },
    {
        "kind": "books#volume",
        "id": "23xuAAAAMAAJ",
        "etag": "VaoPCbPSwiE",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/23xuAAAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử Việt Nam từ nguồn gốc đến năm 1884",
            "authors": [
                "Phan Quang Nguyễn",
                "Xuân Đàn Võ"
            ],
            "publishedDate": "2000",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015051482274"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 518,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.3.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=23xuAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=23xuAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=23xuAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=7&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=23xuAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_Vi%E1%BB%87t_Nam_t%E1%BB%AB_ngu%E1%BB%93n_g%E1%BB%91.html?hl=&id=23xuAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=23xuAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "oMlmPx0PbOIC",
        "etag": "qFzv8gXHJmo",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/oMlmPx0PbOIC",
        "volumeInfo": {
            "title": "Tập san nghiên cứu lịch sử",
            "publishedDate": "2013",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UCR:31210023904855"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 84,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.3.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=oMlmPx0PbOIC&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=oMlmPx0PbOIC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=oMlmPx0PbOIC&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=8&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=oMlmPx0PbOIC&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/T%E1%BA%ADp_san_nghi%C3%AAn_c%E1%BB%A9u_l%E1%BB%8Bch_s%E1%BB%AD.html?hl=&id=oMlmPx0PbOIC"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=oMlmPx0PbOIC&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "Gw-75wjiiW0C",
        "etag": "7RhbvahMduw",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/Gw-75wjiiW0C",
        "volumeInfo": {
            "title": "Đuó̂c lá dừa",
            "subtitle": "tiẻ̂u thuyé̂t lịch sử",
            "authors": [
                "Hoài Anh"
            ],
            "publishedDate": "2006",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UCR:31210021735806"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 292,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.3.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=Gw-75wjiiW0C&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=Gw-75wjiiW0C&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=Gw-75wjiiW0C&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=10&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=Gw-75wjiiW0C&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/%C4%90u%C3%B3%CC%82c_l%C3%A1_d%E1%BB%ABa.html?hl=&id=Gw-75wjiiW0C"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=Gw-75wjiiW0C&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "AUxQAQAAMAAJ",
        "etag": "3UuZi3HUX0A",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/AUxQAQAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử Việt Nam từ nguò̂n gó̂c đé̂n thé̂ kỷ XIX",
            "authors": [
                "Duy Anh Đào"
            ],
            "publishedDate": "2007",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UCBK:C070009549"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 524,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.3.3.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=AUxQAQAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=AUxQAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=AUxQAQAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=11&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=AUxQAQAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_Vi%E1%BB%87t_Nam_t%E1%BB%AB_ngu%C3%B2%CC%82n_g%C3%B3.html?hl=&id=AUxQAQAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=AUxQAQAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "QfQyAAAAMAAJ",
        "etag": "LBjOROhMnCo",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/QfQyAAAAMAAJ",
        "volumeInfo": {
            "title": "Thế kỷ X, những vấn đề lịch sử",
            "authors": [
                "Viện sử học (Vietnam)"
            ],
            "publishedDate": "1984",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015023275038"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 306,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.9.4.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=QfQyAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=QfQyAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=QfQyAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=12&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=QfQyAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/Th%E1%BA%BF_k%E1%BB%B7_X_nh%E1%BB%AFng_v%E1%BA%A5n_%C4%91%E1%BB%81_l%E1%BB%8Bch.html?hl=&id=QfQyAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=QfQyAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "c29uAAAAMAAJ",
        "etag": "/qDqfIim0vA",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/c29uAAAAMAAJ",
        "volumeInfo": {
            "title": "Một só̂ trận quyé̂t chié̂n chié̂n lược trong lịch sử dân tộc",
            "publishedDate": "2004",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015042974058"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 490,
            "printType": "BOOK",
            "categories": [
                "Battles"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "2.5.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=c29uAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=c29uAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=c29uAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=14&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=c29uAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/M%E1%BB%99t_s%C3%B3%CC%82_tr%E1%BA%ADn_quy%C3%A9%CC%82t_chi%C3%A9%CC%82n_chi.html?hl=&id=c29uAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=c29uAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "k1rURuys4egC",
        "etag": "iiuU+AP6s6w",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/k1rURuys4egC",
        "volumeInfo": {
            "title": "Lịch sử Việt Nam",
            "publishedDate": "2004",
            "description": "History of Vietnam.",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UCLA:L0090964941"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 514,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.3.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=k1rURuys4egC&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=k1rURuys4egC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=k1rURuys4egC&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=15&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=k1rURuys4egC&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_Vi%E1%BB%87t_Nam.html?hl=&id=k1rURuys4egC"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=k1rURuys4egC&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "History of Vietnam."
        }
    },
    {
        "kind": "books#volume",
        "id": "f95o0AEACAAJ",
        "etag": "9tCnyj02YVs",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/f95o0AEACAAJ",
        "volumeInfo": {
            "title": "Lịch Sử Việt Nam Thời Tự Chủ - Tập Ba (hard cover)",
            "authors": [
                "Bach Thao Ho"
            ],
            "publishedDate": "2023-12-31",
            "description": "Vướng chút cơ duyên về lịch sử, tôi có dịp dịch các tư liệu Việt sử trong các bộ sử Trung Quốc như Nhị Thập Ngũ Sử, Tư Trị Thông Giám, Tục Tư Trị Thông Giám Trường Biên, Minh Thực Lục, Thanh Thực Lục. Một số tư liệu được in trong các sách xuất bản tại Hoa Kỳ như Những Nét Đặc Trưng Về Lịch Sử Việt Nam, Việt Sử Tư Liệu Và Lời Bàn; tại trong nước như Minh Thực Lục, Thanh Thực Lục. Tuy đã về già, nhưng cảm thấy bổn phận chưa hoàn thành; nên mấy năm nay lại làm công tác tổng hợp, gộp các sử liệu nêu trên với các bộ sử lớn Việt Nam như Toàn Thư, Khâm Định, Đại Nam Thực Lục, nhắm hoàn thành sách mới, với nhan đề Lịch Sử Việt Nam Thời Tự Chủ. Bộ sử này khởi đầu từ thời Khúc Tiên Chúa giành độc lập [906], cho đến hiện đại. Nhờ tư liệu phong phú, nên hiện nay tuy mới soạn đến giai đoạn Vua Quang Trung đại phá quân Thanh [1789]; tính ra chưa đầy 900 năm, đã hoàn thành được 2000 trang; xét về số lượng, quả là dồi dào! A century ago, scholar Tran Trong Kim published a history book, less than 1,000 pages, named \"Việt Nam Sử Lược\" which covers the period of 4,000 years Vietnamese history. In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named \"Lịch Sử Việt Nam Thời Tự Chủ\" (2,000 pages), presents 900 years in the independent time. Historic lovers, please read it for valuable documents! Thank you. Hồ Bạch Thảo",
            "industryIdentifiers": [
                {
                    "type": "ISBN_13",
                    "identifier": "9798869086457"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 0,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=f95o0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=f95o0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=f95o0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=16&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=f95o0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_S%E1%BB%AD_Vi%E1%BB%87t_Nam_Th%E1%BB%9Di_T%E1%BB%B1_Ch%E1%BB%A7.html?hl=&id=f95o0AEACAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=f95o0AEACAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named &quot;Lịch Sử Việt Nam Thời Tự Chủ&quot; (2,000 pages), presents 900 years in the independent time."
        }
    },
    {
        "kind": "books#volume",
        "id": "Jfhs0AEACAAJ",
        "etag": "WbXSOTWE+IA",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/Jfhs0AEACAAJ",
        "volumeInfo": {
            "title": "Lịch Sử Việt Nam Thời Tự Chủ - Tập Một (hard cover - groundwood)",
            "authors": [
                "Bach Thao Ho"
            ],
            "publishedDate": "2023-12-31",
            "description": "Vướng chút cơ duyên về lịch sử, tôi có dịp dịch các tư liệu Việt sử trong các bộ sử Trung Quốc như Nhị Thập Ngũ Sử, Tư Trị Thông Giám, Tục Tư Trị Thông Giám Trường Biên, Minh Thực Lục, Thanh Thực Lục. Một số tư liệu được in trong các sách xuất bản tại Hoa Kỳ như Những Nét Đặc Trưng Về Lịch Sử Việt Nam, Việt Sử Tư Liệu Và Lời Bàn; tại trong nước như Minh Thực Lục, Thanh Thực Lục. Tuy đã về già, nhưng cảm thấy bổn phận chưa hoàn thành; nên mấy năm nay lại làm công tác tổng hợp, gộp các sử liệu nêu trên với các bộ sử lớn Việt Nam như Toàn Thư, Khâm Định, Đại Nam Thực Lục, nhắm hoàn thành sách mới, với nhan đề Lịch Sử Việt Nam Thời Tự Chủ. Bộ sử này khởi đầu từ thời Khúc Tiên Chúa giành độc lập [906], cho đến hiện đại. Nhờ tư liệu phong phú, nên hiện nay tuy mới soạn đến giai đoạn Vua Quang Trung đại phá quân Thanh [1789]; tính ra chưa đầy 900 năm, đã hoàn thành được 2000 trang; xét về số lượng, quả là dồi dào! A century ago, scholar Tran Trong Kim published a history book, less than 1,000 pages, named \"Việt Nam Sử Lược\" which covers the period of 4,000 years Vietnamese history. In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named \"Lịch Sử Việt Nam Thời Tự Chủ\" (2,000 pages), presents 900 years in the independent time. Historic lovers, please read it for valuable documents! Thank you. Hồ Bạch Thảo",
            "industryIdentifiers": [
                {
                    "type": "ISBN_13",
                    "identifier": "9798869086433"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 0,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=Jfhs0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=Jfhs0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=Jfhs0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=17&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=Jfhs0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_S%E1%BB%AD_Vi%E1%BB%87t_Nam_Th%E1%BB%9Di_T%E1%BB%B1_Ch%E1%BB%A7.html?hl=&id=Jfhs0AEACAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=Jfhs0AEACAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named &quot;Lịch Sử Việt Nam Thời Tự Chủ&quot; (2,000 pages), presents 900 years in the independent time."
        }
    },
    {
        "kind": "books#volume",
        "id": "1OQjAAAAMAAJ",
        "etag": "6Pw8ZlcyhLs",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/1OQjAAAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử Đảng cộng sản Việt Nam",
            "subtitle": "chương trình cao cá̂p",
            "publishedDate": "1983",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015014865995"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 208,
            "printType": "BOOK",
            "categories": [
                "Communist parties"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "2.5.3.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=1OQjAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=1OQjAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=1OQjAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=23&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=1OQjAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_%C4%90%E1%BA%A3ng_c%E1%BB%99ng_s%E1%BA%A3n_Vi%E1%BB%87t.html?hl=&id=1OQjAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=1OQjAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "ZDFv0AEACAAJ",
        "etag": "7iNV+Sa+w6o",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/ZDFv0AEACAAJ",
        "volumeInfo": {
            "title": "Lịch Sử Việt Nam Thời Tự Chủ - Tập Năm (hard cover - groundwood)",
            "authors": [
                "Bach Thao Ho"
            ],
            "publishedDate": "2024-01-31",
            "description": "Vướng chút cơ duyên về lịch sử, tôi có dịp dịch các tư liệu Việt sử trong các bộ sử Trung Quốc như Nhị Thập Ngũ Sử, Tư Trị Thông Giám, Tục Tư Trị Thông Giám Trường Biên, Minh Thực Lục, Thanh Thực Lục. Một số tư liệu được in trong các sách xuất bản tại Hoa Kỳ như Những Nét Đặc Trưng Về Lịch Sử Việt Nam, Việt Sử Tư Liệu Và Lời Bàn; tại trong nước như Minh Thực Lục, Thanh Thực Lục. Tuy đã về già, nhưng cảm thấy bổn phận chưa hoàn thành; nên mấy năm nay lại làm công tác tổng hợp, gộp các sử liệu nêu trên với các bộ sử lớn Việt Nam như Toàn Thư, Khâm Định, Đại Nam Thực Lục, nhắm hoàn thành sách mới, với nhan đề Lịch Sử Việt Nam Thời Tự Chủ. Bộ sử này khởi đầu từ thời Khúc Tiên Chúa giành độc lập [906], cho đến hiện đại. Nhờ tư liệu phong phú, nên hiện nay tuy mới soạn đến giai đoạn Vua Quang Trung đại phá quân Thanh [1789]; tính ra chưa đầy 900 năm, đã hoàn thành được 2000 trang; xét về số lượng, quả là dồi dào! A century ago, scholar Tran Trong Kim published a history book, less than 1,000 pages, named \"Việt Nam Sử Lược\" which covers the period of 4,000 years Vietnamese history. In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named \"Lịch Sử Việt Nam Thời Tự Chủ\" (2,000 pages), presents 900 years in the independent time. Historic lovers, please read it for valuable documents! Thank you. Hồ Bạch Thảo",
            "industryIdentifiers": [
                {
                    "type": "ISBN_13",
                    "identifier": "9798869086471"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 0,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=ZDFv0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=ZDFv0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=ZDFv0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=26&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=ZDFv0AEACAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_S%E1%BB%AD_Vi%E1%BB%87t_Nam_Th%E1%BB%9Di_T%E1%BB%B1_Ch%E1%BB%A7.html?hl=&id=ZDFv0AEACAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=ZDFv0AEACAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "In the present, thanks to more documents from old Vietnamese and Chinese history; I have completed the book named &quot;Lịch Sử Việt Nam Thời Tự Chủ&quot; (2,000 pages), presents 900 years in the independent time."
        }
    },
    {
        "kind": "books#volume",
        "id": "xrTsAAAAMAAJ",
        "etag": "1A95tJY1Msg",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/xrTsAAAAMAAJ",
        "volumeInfo": {
            "title": "Một số vấn đề về lịch sử kinh tế Việt Nam",
            "authors": [
                "Quốc Sử Lê"
            ],
            "publishedDate": "1998",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015036353459"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 528,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.10.2.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=xrTsAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=xrTsAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=xrTsAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=30&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=xrTsAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/M%E1%BB%99t_s%E1%BB%91_v%E1%BA%A5n_%C4%91%E1%BB%81_v%E1%BB%81_l%E1%BB%8Bch_s%E1%BB%AD.html?hl=&id=xrTsAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=xrTsAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "eBHdEAAAQBAJ",
        "etag": "KzkbjVRfD9Q",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/eBHdEAAAQBAJ",
        "volumeInfo": {
            "title": "Tổng Kết Lịch Sử Đấu Tranh Chống Gián Điệp 1945-2005",
            "authors": [
                "Nhiều Tác Giả",
                "StreettLib"
            ],
            "publisher": "NXB Công An Nhân Dân",
            "publishedDate": "2023-10-16",
            "description": "Lịch sử của dân tộc Việt Nam là lịch sử đấu tranh dựng nước và giữ nước. Trải qua hàng ngàn năm đấu tranh, bằng truyền thống đoàn kết và ý chí quật cường mà một nước nhỏ như Việt Nam ta đã lần lượt đánh bại những thế lực ngoại xâm sừng sỏ nhất đương thời, cắm những mốc son trong phong trào đấu tranh giành độc lập trên thế giới. Ngày 3-2-1930, Đảng Cộng sản Việt Nam thành lập, mở ra bước ngoặt lịch sử vĩ đại cho cách mạng nước ta, đánh dấu một kỷ nguyên mới - kỷ nguyên của thời đại Hồ Chí Minh. Dưới sự lãnh đạo của Đảng, nhân dân Việt Nam nhất tề đứng lên đánh Pháp, đuổi Nhật, lật đổ chế độ phong kiến, lập ra Nhà nước Việt Nam Dân chủ Cộng hoà. Từ khi nước Việt Nam Dân chủ Cộng hoà ra đời, Đảng tiếp tục khẳng định vai trò lãnh đạo của mình, dẫn dắt cả dân tộc tiến hành cuộc chiến tranh giải phóng, đánh thắng hai đế quốc là Pháp và Mỹ, hoàn thành cuộc cách mạng dân tộc dân chủ, đưa nước Việt Nam thống nhất tiến lên con đường cách mạng xã hội chủ nghĩa theo chủ nghĩa Mác - Lênin, tư tưởng Hồ Chí Minh. Đấu tranh chống gián điệp là một bộ phận không tách rời của sự nghiệp cách mạng dưới sự lãnh đạo của Đảng Cộng sản Việt Nam. Trong suốt những chặng đường lãnh đạo của mình, Đảng, Nhà nước đặc biệt quan tâm chỉ đạo hệ thống chính trị của Đảng cùng toàn thể nhân dân, xây dựng nền an ninh nhân dân vững mạnh, xây dựng thế trận “phòng và chống\" phản cách mạng hoàn chỉnh, đánh bại âm mưu, hoạt động của các cơ quan gián điệp, phục vụ đắc lực cho cuộc chiến tranh giải phóng và xây dựng Tổ quốc Việt Nam xã hội chủ nghĩa. Lực lượng chống gián điệp thuộc Công an nhân dân Việt Nam là lực lượng chuyên ngành, giữ vai trò nòng cốt, ra đời, trưởng thành mọi mặt từ cuộc đấu tranh gay go, quyết liệt và lâu dài đó. Trải qua 60 năm đấu tranh cách mạng, khi đất nước có chiến tranh hay khi đất nước đã hoà bình thì trận tuyến đấu tranh chống gián điệp vẫn không ngơi nghỉ, vẫn vô cùng gay go, quyết liệt. Đối tượng đấu tranh của ta là cơ quan tình báo gián điệp của các thế lực ngoại xâm, bọn phản động quốc tế, các thế lực thù địch hòng thực hiện âm mưu thôn tính và xâm lược. Điệp viên của địch không chỉ có vỏ bọc chắc chắn, trà trộn trong xã hội, lẩn khuất quanh ta mà chúng còn được các lực lượng vũ trang xâm lược và bọn phản động hỗ trợ, được trang bị các loại phương tiện hoạt động hiện đại và tinh vi. Nhưng cuối cùng, chúng ta đã giành thắng lợi vẻ vang, góp phần xứng đáng vào sự nghiệp cách mạng vĩ đại của dân tộc. Nguồn gốc để giành thắng lợi trên mặt trận đấu tranh bí mật này được khởi nguồn từ tư tưởng chỉ đạo, quá trình hoàn thiện đường lối, phương châm, nguyên tắc đấu tranh chống phản cách mạng của Đảng; là chủ trương xây dựng thế trận “phòng và chống” gián điệp, phát triển thành nền an ninh nhân dân vững mạnh; là quyết sách trong tổ chức lực lượng đấu tranh, phát huy cao độ tinh thần yêu nước và ý thức cảnh giác cách mạng của nhân dân, phối hợp chặt chẽ của các cơ quan đơn vị với nghiệp vụ phản gián sắc bén của cơ quan chuyên môn thành sức mạnh tổng hợp; là tinh thần chiến đấu mưu trí, sáng tạo, quyết đoán và quyết thắng của các thế hệ An ninh nhân dân trước mọi kẻ thù. Tổng kết lịch sử đấu tranh chống gián điệp là thông qua hệ thống các sự kiện lịch sử để làm rõ quá trình hình thành, phát triển về đường lối, sự lãnh đạo của Đảng, của Nhà nước và của Bộ Công an; làm rõ quá trình tổ chức lực lượng tham gia đấu tranh và xây dựng thế trận “phòng chống\" gián điệp; làm rõ cách thức triển khai các biện pháp đấu tranh của lực lượng nòng cốt trong cuộc đấu tranh này. Qua đó rút ra những bài học lịch sử có giá trị áp dụng vào thực tiễn sinh động đang diễn ra, góp phần hoàn chỉnh hệ thống lý luận chuyên ngành để các thế hệ mai sau chiêm nghiệm và kế thừa. Tác phẩm “Tổng kết lịch sử đấu tranh chống gián điệp (1945-2005)\", được hoàn thành với sự hướng dẫn tận tình về phương pháp luận Tổng kết của Viện lịch sử Công an và các nhà sử học uy tín; kiến thức thực tiễn phong phú và vô cùng quý báu của các đồng chí lãnh đạo chủ chốt trên lĩnh vực đấu tranh chống gián điệp của lực lượng An ninh qua các giai đoạn lịch sử. Đội ngũ nghiên cứu đã cố gắng khai thác các nguồn tư liệu để nhận thức lịch sử một cách trung thực, khách quan với mong muốn sẽ là tác phẩm hữu ích cho công tác nghiên cứu khoa học cũng như vận dụng vào thực tiễn của mặt trận đấu tranh bí mật vô cùng khó khăn, gian khổ, nhiều yếu tố nhạy cảm và khó lường. Xin được trân trọng cảm ơn Viện Lịch sử Công an, các đồng chí nhân chứng lịch sử, các nhà nghiên cứu trong và ngoài ngành đã hướng dẫn, cung cấp tư liệu và đóng góp ý kiến quý báu cho tác phẩm. Xin trân trọng giới thiệu cùng bạn đọc.",
            "readingModes": {
                "text": true,
                "image": true
            },
            "pageCount": 387,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.1.1.0.preview.3",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=eBHdEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=eBHdEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=eBHdEAAAQBAJ&printsec=frontcover&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=31&source=gbs_api",
            "infoLink": "https://play.google.com/store/books/details?id=eBHdEAAAQBAJ&source=gbs_api",
            "canonicalVolumeLink": "https://play.google.com/store/books/details?id=eBHdEAAAQBAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "FOR_SALE",
            "isEbook": true,
            "listPrice": {
                "amount": 75599,
                "currencyCode": "VND"
            },
            "retailPrice": {
                "amount": 62747,
                "currencyCode": "VND"
            },
            "buyLink": "https://play.google.com/store/books/details?id=eBHdEAAAQBAJ&rdid=book-eBHdEAAAQBAJ&rdot=1&source=gbs_api",
            "offers": [
                {
                    "finskyOfferType": 1,
                    "listPrice": {
                        "amountInMicros": 75599000000,
                        "currencyCode": "VND"
                    },
                    "retailPrice": {
                        "amountInMicros": 62747000000,
                        "currencyCode": "VND"
                    }
                }
            ]
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "PARTIAL",
            "embeddable": true,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": true,
                "acsTokenLink": "http://books.google.com.vn/books/download/T%E1%BB%95ng_K%E1%BA%BFt_L%E1%BB%8Bch_S%E1%BB%AD_%C4%90%E1%BA%A5u_Tranh_Ch-sample-epub.acsm?id=eBHdEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"
            },
            "pdf": {
                "isAvailable": true,
                "acsTokenLink": "http://books.google.com.vn/books/download/T%E1%BB%95ng_K%E1%BA%BFt_L%E1%BB%8Bch_S%E1%BB%AD_%C4%90%E1%BA%A5u_Tranh_Ch-sample-pdf.acsm?id=eBHdEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"
            },
            "webReaderLink": "http://play.google.com/books/reader?id=eBHdEAAAQBAJ&hl=&source=gbs_api",
            "accessViewStatus": "SAMPLE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "Tác phẩm “Tổng kết lịch sử đấu tranh chống gián điệp (1945-2005)&quot;, được hoàn thành với sự hướng dẫn tận tình về phương pháp luận Tổng kết của Viện lịch sử Công an và các nhà ..."
        }
    },
    {
        "kind": "books#volume",
        "id": "RxEsAAAAMAAJ",
        "etag": "tVf+gm3Qxp8",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/RxEsAAAAMAAJ",
        "volumeInfo": {
            "title": "Việt-Nam những ngày lịch sử",
            "authors": [
                "Tường Bách Nguyễn"
            ],
            "publishedDate": "1981",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015019368052"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 168,
            "printType": "BOOK",
            "categories": [
                "Political refugees"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "3.8.4.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=RxEsAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=RxEsAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=RxEsAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=32&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=RxEsAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/Vi%E1%BB%87t_Nam_nh%E1%BB%AFng_ng%C3%A0y_l%E1%BB%8Bch_s%E1%BB%AD.html?hl=&id=RxEsAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=RxEsAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "FjWOAAAAMAAJ",
        "etag": "JrKGn/1PUsA",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/FjWOAAAAMAAJ",
        "volumeInfo": {
            "title": "Bốn mươi năm ngành lịch sử Đảng cộng sả̉n Việt Nam",
            "publishedDate": "2002",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015052343178"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 490,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.5.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=FjWOAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=FjWOAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=FjWOAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=33&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=FjWOAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/B%E1%BB%91n_m%C6%B0%C6%A1i_n%C4%83m_ng%C3%A0nh_l%E1%BB%8Bch_s%E1%BB%AD_%C4%90.html?hl=&id=FjWOAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=FjWOAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "k1VQAQAAMAAJ",
        "etag": "CiLs3zgaOKk",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/k1VQAQAAMAAJ",
        "volumeInfo": {
            "title": "Hò̂ Chí Minh bàn vè̂ lịch sử",
            "authors": [
                "Chí Minh Hồ"
            ],
            "publishedDate": "1995",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UCBK:C067729118"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 164,
            "printType": "BOOK",
            "categories": [
                "History, Modern"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.3.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=k1VQAQAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=k1VQAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=k1VQAQAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=34&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=k1VQAQAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/H%C3%B2%CC%82_Ch%C3%AD_Minh_b%C3%A0n_v%C3%A8%CC%82_l%E1%BB%8Bch_s%E1%BB%AD.html?hl=&id=k1VQAQAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=k1VQAQAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "xfvcEAAAQBAJ",
        "etag": "/9Aoz8okK4o",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/xfvcEAAAQBAJ",
        "volumeInfo": {
            "title": "Trung Xô Mỹ Cuộc Đối Đầu Lịch Sử",
            "authors": [
                " Lý Kiện",
                "StreetLib"
            ],
            "publisher": "NXB Thanh Niên",
            "description": "Ngày 9 tháng 5 năm 1945, Matxcơva rợp trời cờ đỏ, đua nở trăm hoa và những hàng cây nghiêng bóng. Màn đêm buông xuống. Mátxcơva hoa đăng rực rỡ. Những ngọn đèn huỳnh quan, đèn màu, đủ loại lớn nhỏ, chiếu sáng trưng mọi phố xá, mọi ngõ ngách. Trên những thảm cỏ xanh bên đường, trên tầng thượng các nhà gác, chỗ nào cũng có người nâng cốc, chạm ly. Trong công viên, ngoài quảng trường, người chen chúc, đầu nhấp nhô, chẳng cần quen biết cũng ôm lấy nhau, những tiếng cười sung sướng, những tiếng khóc tức tưởi… 0 giờ 43 ngày hôm đó, tại Cachôxte Béclin, nước Đức phát-xít đặt bút ký vào giấy xin đầu hàng vô điều kiện. Cùng chiều hôm đó, Đài phát thanh Liên Xô thông báo với cả nước tin vui lớn lao này. Chính phủ Liên Xô quyết định: Ngày 9 tháng 5 được lấy làm Ngày chiến thắng của toàn dân. Tương lại chợt bừng sáng. Bóng tối bỗng xua tan. rừng rực một không khí cuồng hoan. Ở Hồng trường, ở quảng trường Mônegiư, ở phố Người đi săn… ở tất cả những nơi có thể tụ tập được, người ta mặc sức ca hát, quay cuồng trong những điệu múa… Cũng lúc đó, trong sứ quán Mỹ nằm ở gần quảng trường Mônegiư, viên Tham tán Gióocgiơ Kâynan nấp sau tấm rèm cửa sổ chăm chú quan sát cảnh tượng tưng bừng chung quanh. Đột nhiên, ông ta buông ra một câu nói rợn người: Người ta đang hoan hô! Người ta đang nhảy múa! Họ tưởng chiến tranh đã chấm dứt! Mà chiến tranh lại chỉ mới bắt đầu! Một âm hồn đang lượn lờ ngoài ngưỡng cửa của hoà bình… Cuối cùng, nó đường hoàng bước vào nhà, rôi giờ đây trời bão táp, từng toà nhà đồ sộ bị sập đổ… Khi Liên Xô bị giải thể, có người nói: “Ngọn lửa chiến tranh lạnh đã tắt”. Khi mâu thuẫn Mỹ - Nga trở nên căng thẳng, lại có người bảo: “Đống tro tàn của cuộc chiến tranh lạnh đang được khơi lại”. Khi quan hệ Trung - Mỹ khủng hoảng càng có nhiều người nói: “Thế giới đang đứng trước một cuộc chiến tranh lạnh mới”. “Ôn cố tri ân”, ôn những cái cũ để biết thêm điều mới, chúng ta hãy dạo bước dọc theo hành lang của năm tháng, đi tìm kiếm câu trả lời khó khăn trong thời đại ngày nay. Mục lục: Lời dẫn Chương 1: Âm hồn sổ lồng Chương 2: Bóng đen tái hiện Chương 3: Gây dựng cơ đồ mới Chương 4: Mỹ - Tưởng bàn tính ký kết Hiệp ước phòng thủ chung Chương 5: Hai lần gặp gỡ giữa người đứng đầu hai nước Trung-Xô Chương 6: Hội đàm trại đa Ví Chương 7: Sự mất tích bí ẩn tên gián điệp trên không của Mỹ Chương 8: Từ hậu trường bước ra sân khấu Chương 9: Hội nghị ở Glasbâu Chương 10: Vị khách bí ẩn của Điếu ngư đài Chương 11: Thuận gió giương buồm Chương 12: Mỹ-Xô ký hiệp ước Viên Chương 13: Rigân năm lần gặp Goóbachốp Chương 14: Bức tường Beclin sụp đổ Chương 15: Chiến lược ngoại giao của nước Nga thay đổi Chương 16: Quan hệ Trung - Mỹ lại lâm vào tình trạng bế tắc Chương 17: Mạn kịch Lý Đang Huy đi thẩm Mỹ Chương 18: Nước Mỹ nhòm ngó Tây Tạng từ lâu Chương 19: Để cho thế gới tới hoà bình Chương 20: Mở ra bức màn đàm phán Chương 21: Tăng cường đồng minh Mỹ - Nhật Chương 22: Cuộc chiến thương mại Trung - Mỹ. Mời các bạn mượn đọc sách Trung Xô Mỹ Cuộc Đối Đầu Lịch Sử của tác giả Lý Kiện.",
            "readingModes": {
                "text": false,
                "image": true
            },
            "pageCount": 1156,
            "printType": "BOOK",
            "categories": [
                "History"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "preview-1.0.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=xfvcEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=xfvcEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=xfvcEAAAQBAJ&printsec=frontcover&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=36&source=gbs_api",
            "infoLink": "https://play.google.com/store/books/details?id=xfvcEAAAQBAJ&source=gbs_api",
            "canonicalVolumeLink": "https://play.google.com/store/books/details?id=xfvcEAAAQBAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "FOR_SALE",
            "isEbook": true,
            "listPrice": {
                "amount": 77699,
                "currencyCode": "VND"
            },
            "retailPrice": {
                "amount": 64490,
                "currencyCode": "VND"
            },
            "buyLink": "https://play.google.com/store/books/details?id=xfvcEAAAQBAJ&rdid=book-xfvcEAAAQBAJ&rdot=1&source=gbs_api",
            "offers": [
                {
                    "finskyOfferType": 1,
                    "listPrice": {
                        "amountInMicros": 77699000000,
                        "currencyCode": "VND"
                    },
                    "retailPrice": {
                        "amountInMicros": 64490000000,
                        "currencyCode": "VND"
                    }
                }
            ]
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "PARTIAL",
            "embeddable": true,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": true,
                "acsTokenLink": "http://books.google.com.vn/books/download/Trung_X%C3%B4_M%E1%BB%B9_Cu%E1%BB%99c_%C4%90%E1%BB%91i_%C4%90%E1%BA%A7u_L%E1%BB%8B-sample-pdf.acsm?id=xfvcEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api"
            },
            "webReaderLink": "http://play.google.com/books/reader?id=xfvcEAAAQBAJ&hl=&source=gbs_api",
            "accessViewStatus": "SAMPLE",
            "quoteSharingAllowed": false
        },
        "searchInfo": {
            "textSnippet": "Mời các bạn mượn đọc sách Trung Xô Mỹ Cuộc Đối Đầu Lịch Sử của tác giả Lý Kiện."
        }
    },
    {
        "kind": "books#volume",
        "id": "BSpIAAAAMAAJ",
        "etag": "dOgCKGq58TY",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/BSpIAAAAMAAJ",
        "volumeInfo": {
            "title": "Những bí ả̂n lịch sử dưới ché̂ độ Ngô Đình Diệm",
            "authors": [
                "Trọng Văn Lê"
            ],
            "publishedDate": "1989",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015040716329"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 310,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "1.4.2.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=BSpIAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=BSpIAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=BSpIAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=37&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=BSpIAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/Nh%E1%BB%AFng_b%C3%AD_%E1%BA%A3%CC%82n_l%E1%BB%8Bch_s%E1%BB%AD_d%C6%B0%E1%BB%9Bi_c.html?hl=&id=BSpIAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=BSpIAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "z6DiAAAAMAAJ",
        "etag": "9K04yyirUL0",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/z6DiAAAAMAAJ",
        "volumeInfo": {
            "title": "Việt Nam, đất nước lịch sử văn hóa",
            "publishedDate": "1991",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015029798322"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 250,
            "printType": "BOOK",
            "categories": [
                "Vietnam"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.7.2.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=z6DiAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=z6DiAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=z6DiAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=38&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=z6DiAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/Vi%E1%BB%87t_Nam_%C4%91%E1%BA%A5t_n%C6%B0%E1%BB%9Bc_l%E1%BB%8Bch_s%E1%BB%AD_v.html?hl=&id=z6DiAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=z6DiAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "qIduAAAAMAAJ",
        "etag": "V7nsME93Mek",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/qIduAAAAMAAJ",
        "volumeInfo": {
            "title": "20 trận đánh trong lịch sử dân tộc",
            "subtitle": "thế kỷ X-XIII",
            "publishedDate": "2003",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015052957845"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 370,
            "printType": "BOOK",
            "categories": [
                "Battles"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.5.1.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=qIduAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=qIduAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=qIduAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=39&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=qIduAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/20_tr%E1%BA%ADn_%C4%91%C3%A1nh_trong_l%E1%BB%8Bch_s%E1%BB%AD_d%C3%A2n.html?hl=&id=qIduAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=qIduAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    },
    {
        "kind": "books#volume",
        "id": "4JLiAAAAMAAJ",
        "etag": "np1PuRNkVzs",
        "selfLink": "https://www.googleapis.com/books/v1/volumes/4JLiAAAAMAAJ",
        "volumeInfo": {
            "title": "Lịch sử nhà nước và pháp luật Việt Nam",
            "subtitle": "từ nguồn gốc đến trước cách mạng tháng Tám 1945",
            "authors": [
                "Thị Phụng Vũ"
            ],
            "publishedDate": "1990",
            "industryIdentifiers": [
                {
                    "type": "OTHER",
                    "identifier": "UOM:39015029789479"
                }
            ],
            "readingModes": {
                "text": false,
                "image": false
            },
            "pageCount": 180,
            "printType": "BOOK",
            "categories": [
                "Law"
            ],
            "maturityRating": "NOT_MATURE",
            "allowAnonLogging": false,
            "contentVersion": "0.4.3.0.preview.0",
            "panelizationSummary": {
                "containsEpubBubbles": false,
                "containsImageBubbles": false
            },
            "imageLinks": {
                "smallThumbnail": "http://books.google.com/books/content?id=4JLiAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
                "thumbnail": "http://books.google.com/books/content?id=4JLiAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
            },
            "language": "vi",
            "previewLink": "http://books.google.com.vn/books?id=4JLiAAAAMAAJ&q=l%E1%BB%8Bch+s%E1%BB%AD&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&cd=40&source=gbs_api",
            "infoLink": "http://books.google.com.vn/books?id=4JLiAAAAMAAJ&dq=l%E1%BB%8Bch+s%E1%BB%AD&hl=&source=gbs_api",
            "canonicalVolumeLink": "https://books.google.com/books/about/L%E1%BB%8Bch_s%E1%BB%AD_nh%C3%A0_n%C6%B0%E1%BB%9Bc_v%C3%A0_ph%C3%A1p_lu%E1%BA%AD.html?hl=&id=4JLiAAAAMAAJ"
        },
        "saleInfo": {
            "country": "VN",
            "saleability": "NOT_FOR_SALE",
            "isEbook": false
        },
        "accessInfo": {
            "country": "VN",
            "viewability": "NO_PAGES",
            "embeddable": false,
            "publicDomain": false,
            "textToSpeechPermission": "ALLOWED",
            "epub": {
                "isAvailable": false
            },
            "pdf": {
                "isAvailable": false
            },
            "webReaderLink": "http://play.google.com/books/reader?id=4JLiAAAAMAAJ&hl=&source=gbs_api",
            "accessViewStatus": "NONE",
            "quoteSharingAllowed": false
        }
    }
]